In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\ascendion\appdata\local\programs\python\python310\lib\site-packages (2.3.1)
Requirement already satisfied: numpy>=1.22.4 in c:\users\ascendion\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.2.6)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ascendion\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ascendion\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ascendion\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\ascendion\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 21.2.3; however, version 25.2 is available.
You should consider upgrading via the 'C:\Users\Ascendion\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

In [2]:
import pandas as pd

In [11]:
emp_df=pd.read_csv("C:\\Users\\Ascendion\\Desktop\\employees.csv") #sep=','

In [41]:
print(emp_df)

       Name   Age Department      Salary  DateOfJoining Designation  \
0     Alice  38.0         IT    91828.15            NaN       Clerk
1       Bob   NaN    Finance         NaN            NaN         NaN
2   Charlie   NaN         HR  9999999.00            NaN     Manager
3     David  41.0        NaN    72011.50            NaN    Engineer
4       Eva  29.0      Admin    84763.20            NaN         NaN
5     Frank  50.0      Sales    64000.00            NaN     Analyst
6     Grace  28.0         IT  9999999.00            NaN       Clerk
7    Hannah  45.0         HR    54000.00            NaN     Manager
8       Ian   NaN      Admin    60000.00            NaN         NaN
9      Jane  33.0        NaN    70000.00            NaN    Engineer
10    Kevin   NaN    Finance         NaN            NaN     Manager
11    Laura  38.0         IT    48000.00            NaN       Clerk
12     Mike  24.0      Sales    82000.00            NaN         NaN
13     Nina  55.0        NaN  9999999.00            NaN     Analyst
14    Oscar  30.0      Admin    61000.00            NaN    Engineer
15      Pam   NaN         HR    67000.00            NaN         NaN
16  Quentin  27.0    Finance    77000.00            NaN    Director
17   Rachel   NaN         IT    76000.00            NaN       Clerk
18      Sam  41.0      Sales    69000.00            NaN    Engineer
19     Tina  33.0      Admin         NaN            NaN     Manager
20      Uma   NaN        NaN    55000.00            NaN    Director
21   Victor  22.0         HR  9999999.00            NaN         NaN
22    Wendy  60.0         IT    73000.00            NaN    Engineer
23   Xander   NaN    Finance    80000.00            NaN         NaN
24   Yvonne  39.0      Sales    67000.00            NaN       Clerk
25     Zack  45.0      Admin         NaN            NaN    Director
26      Leo  33.0         HR         NaN            NaN     Manager
27     Mona  27.0    Finance    58000.00            NaN         NaN
28     Nick  50.0         IT  9999999.00            NaN    Engineer
29    Olive   NaN      Sales    62000.00            NaN         NaN

                  Email    Status
0     alice@example.com    Active
1         invalid_email       NaN
2   charlie@example.com  Inactive
3     david@example.com       NaN
4         invalid_email    Active
5     frank@example.com       NaN
6     grace@example.com  Inactive
7    hannah@example.com       NaN
8         invalid_email       NaN
9      jane@example.com    Active
10        invalid_email       NaN
11    laura@example.com       NaN
12     mike@example.com  Inactive
13        invalid_email       NaN
14    oscar@example.com       NaN
15      pam@example.com    Active
16  quentin@example.com       NaN
17        invalid_email       NaN
18      sam@example.com       NaN
19     tina@example.com  Inactive
20        invalid_email       NaN
21   victor@example.com    Active
22        invalid_email       NaN
23   xander@example.com       NaN
24   yvonne@example.com  Inactive
25     zack@example.com    Active
26        invalid_email       NaN
27     mona@example.com       NaN
28        invalid_email  Inactive
29    olive@example.com       NaN

In [13]:
emp_df.head()

,Name,Age,Department,Salary,DateOfJoining,Designation,Email,Status
0,Alice,38,IT,91828.15,2019-01-10,Clerk,alice@example.com,Active
1,Bob,NaN,Finance,NaN,2017-09-15,NaN,invalid_email,NaN
2,Charlie,Unknown,HR,9999999.00,bad_date,Manager,charlie@example.com,Inactive
3,David,41,NaN,72011.50,NaN,Engineer,david@example.com,NaN
4,Eva,29,Admin,84763.20,2015-06-23,NaN,invalid_email,Active

In [14]:
emp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           30 non-null     object
 1   Age            26 non-null     object
 2   Department     26 non-null     object
 3   Salary         25 non-null     float64
 4   DateOfJoining  23 non-null     object
 5   Designation    21 non-null     object
 6   Email          30 non-null     object
 7   Status         12 non-null     object
dtypes: float64(1), object(7)
memory usage: 2.0+ KB

In [15]:
emp_df.describe()

             Salary
count  2.500000e+01
mean   2.054864e+06
std    4.054497e+06
min    4.800000e+04
25%    6.200000e+04
50%    7.201150e+04
75%    8.476320e+04
max    9.999999e+06

In [16]:
emp_df.dtypes

Name              object
Age               object
Department        object
Salary           float64
DateOfJoining     object
Designation       object
Email             object
Status            object
dtype: object

In [18]:
emp_df.shape

(30, 8)

In [19]:
print(emp_df[['Name','Age']])

       Name      Age
0     Alice       38
1       Bob      NaN
2   Charlie  Unknown
3     David       41
4       Eva       29
5     Frank       50
6     Grace       28
7    Hannah       45
8       Ian  Unknown
9      Jane       33
10    Kevin      NaN
11    Laura       38
12     Mike       24
13     Nina       55
14    Oscar       30
15      Pam  Unknown
16  Quentin       27
17   Rachel      NaN
18      Sam       41
19     Tina       33
20      Uma  Unknown
21   Victor       22
22    Wendy       60
23   Xander      NaN
24   Yvonne       39
25     Zack       45
26      Leo       33
27     Mona       27
28     Nick       50
29    Olive  Unknown

In [28]:
#replace bad strings with NAN

In [29]:
import numpy as np

emp_df.replace(['Unknown', 'NaN', 'N/A', 'bad_date'], np.nan, inplace=True)

In [30]:
print(emp_df)

       Name  Age Department      Salary DateOfJoining Designation  \
0     Alice   38         IT    91828.15    2019-01-10       Clerk
1       Bob  NaN    Finance         NaN    2017-09-15         NaN
2   Charlie  NaN         HR  9999999.00           NaN     Manager
3     David   41        NaN    72011.50           NaN    Engineer
4       Eva   29      Admin    84763.20    2015-06-23         NaN
5     Frank   50      Sales    64000.00    2017-09-15     Analyst
6     Grace   28         IT  9999999.00    2019-01-10       Clerk
7    Hannah   45         HR    54000.00           NaN     Manager
8       Ian  NaN      Admin    60000.00           NaN         NaN
9      Jane   33        NaN    70000.00    2015-06-23    Engineer
10    Kevin  NaN    Finance         NaN    2017-09-15     Manager
11    Laura   38         IT    48000.00           NaN       Clerk
12     Mike   24      Sales    82000.00    2019-01-10         NaN
13     Nina   55        NaN  9999999.00    2015-06-23     Analyst
14    Oscar   30      Admin    61000.00           NaN    Engineer
15      Pam  NaN         HR    67000.00    2017-09-15         NaN
16  Quentin   27    Finance    77000.00           NaN    Director
17   Rachel  NaN         IT    76000.00    2019-01-10       Clerk
18      Sam   41      Sales    69000.00           NaN    Engineer
19     Tina   33      Admin         NaN    2015-06-23     Manager
20      Uma  NaN        NaN    55000.00           NaN    Director
21   Victor   22         HR  9999999.00    2017-09-15         NaN
22    Wendy   60         IT    73000.00           NaN    Engineer
23   Xander  NaN    Finance    80000.00    2019-01-10         NaN
24   Yvonne   39      Sales    67000.00           NaN       Clerk
25     Zack   45      Admin         NaN           NaN    Director
26      Leo   33         HR         NaN    2017-09-15     Manager
27     Mona   27    Finance    58000.00    2015-06-23         NaN
28     Nick   50         IT  9999999.00           NaN    Engineer
29    Olive  NaN      Sales    62000.00           NaN         NaN

                  Email    Status
0     alice@example.com    Active
1         invalid_email       NaN
2   charlie@example.com  Inactive
3     david@example.com       NaN
4         invalid_email    Active
5     frank@example.com       NaN
6     grace@example.com  Inactive
7    hannah@example.com       NaN
8         invalid_email       NaN
9      jane@example.com    Active
10        invalid_email       NaN
11    laura@example.com       NaN
12     mike@example.com  Inactive
13        invalid_email       NaN
14    oscar@example.com       NaN
15      pam@example.com    Active
16  quentin@example.com       NaN
17        invalid_email       NaN
18      sam@example.com       NaN
19     tina@example.com  Inactive
20        invalid_email       NaN
21   victor@example.com    Active
22        invalid_email       NaN
23   xander@example.com       NaN
24   yvonne@example.com  Inactive
25     zack@example.com    Active
26        invalid_email       NaN
27     mona@example.com       NaN
28        invalid_email  Inactive
29    olive@example.com       NaN

In [32]:
emp_df.dtypes

Name              object
Age               object
Department        object
Salary           float64
DateOfJoining     object
Designation       object
Email             object
Status            object
dtype: object

In [31]:
#Convert data type

In [34]:
emp_df['Age']=pd.to_numeric(emp_df['Age'],errors='coerce')
emp_df['Salary']=pd.to_numeric(emp_df['Salary'],errors='coerce')
emp_df['DateOfJoining']=pd.to_numeric(emp_df['DateOfJoining'],errors='coerce')

In [35]:
emp_df.dtypes

Name              object
Age              float64
Department        object
Salary           float64
DateOfJoining    float64
Designation       object
Email             object
Status            object
dtype: object

In [36]:
 #Step 4:Clean Designation column

In [38]:
emp_df['Designation']=emp_df['Designation'].str.strip().str.title()

In [39]:
#Step 5: Validation email address using regax

In [40]:
import re

In [42]:
def is_valid_email(email):
    if pd.isna(email): return False
    pattern =r"^[\w\.-]+@[\w\.-]+\.\w+$"
    return bool(re.match(pattern, str(email)))

emp_df['EmailValid'] = emp_df['Email'].apply(is_valid_email)

In [45]:
print(emp_df[['Designation','Email','EmailValid']])

   Designation                Email  EmailValid
0        Clerk    alice@example.com        True
1          NaN        invalid_email       False
2      Manager  charlie@example.com        True
3     Engineer    david@example.com        True
4          NaN        invalid_email       False
5      Analyst    frank@example.com        True
6        Clerk    grace@example.com        True
7      Manager   hannah@example.com        True
8          NaN        invalid_email       False
9     Engineer     jane@example.com        True
10     Manager        invalid_email       False
11       Clerk    laura@example.com        True
12         NaN     mike@example.com        True
13     Analyst        invalid_email       False
14    Engineer    oscar@example.com        True
15         NaN      pam@example.com        True
16    Director  quentin@example.com        True
17       Clerk        invalid_email       False
18    Engineer      sam@example.com        True
19     Manager     tina@example.com        True
20    Director        invalid_email       False
21         NaN   victor@example.com        True
22    Engineer        invalid_email       False
23         NaN   xander@example.com        True
24       Clerk   yvonne@example.com        True
25    Director     zack@example.com        True
26     Manager        invalid_email       False
27         NaN     mona@example.com        True
28    Engineer        invalid_email       False
29         NaN    olive@example.com        True

In [46]:
#Remove salary oulliner

In [47]:
emp_df = emp_df[emp_df['Salary'] < 500000]

In [48]:
print(emp_df.count())

Name             20
Age              14
Department       17
Salary           20
DateOfJoining     0
Designation      13
Email            20
Status            6
EmailValid       20
dtype: int64

Zscore ,IQR